---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetBarsNumber
source: html/bde20032-f24e-ab77-6636-a59c4cebd5fa.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetBarsNumber Method

Gets the number of bars specified in the layout options.
 This is used to calculate the sets driven by bar number.

## Syntax (C#)
```csharp
public int GetBarsNumber()
```

## Returns
Returns the number of bars specified in the layout options.